** Personal Information
#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Martin Homuth"
  user-mail-address "martin.homuth@googlemail.com")
#+END_SRC

#+RESULTS:
: martin.homuth@googlemail.com

*** Backups
By default Emacs stores all of the backup files (the =~= backup files) in the .emacs.d folder. This is something we want to change right away
#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
#+END_SRC

Sacha said: "Disk space is cheap. Save lots"
#+BEGIN_SRC emacs-lisp
(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
#+END_SRC

#+RESULTS:
| .* | ~/.emacs.d/auto-save-list/ | t |

*** History
From [[http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html#fn.2][Grant Rettke (Orgmode.org)]]
#+BEGIN_SRC emacs-lisp
(setq savehist-file "~/.emacs.d/savehist")
(savehist-mode 1)
(setq history-length t)
(setq history-delete-duplicates t)
(setq savehist-save-minibuffer-history 1)
(setq savehist-additional-variables
      '(kill-ring
        search-ring
        regexp-search-ring))
#+END_SRC 

#+RESULTS:
| kill-ring | search-ring | regexp-search-ring |

*** UTF-8
From [[http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html][here]]

#+BEGIN_SRC emacs-lisp
  (prefer-coding-system 'utf-8)
  (when (display-graphic-p)
    (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+END_SRC

#+RESULTS:
| UTF8_STRING | COMPOUND_TEXT | TEXT | STRING |
*** Dired
From [[http://www.masteringemacs.org/articles/2011/03/25/working-multiple-files-dired/][here]]
#+BEGIN_SRC emacs-lisp
(require 'find-dired)
(setq find-ls-option '("-print0 | xargs -0 ls -ld" . "-ld"))
#+END_SRC

#+RESULTS:
: (-print0 | xargs -0 ls -ld . -ld)

*** Auto Fill Mode
#+BEGIN_SRC emacs-lisp
(setq auto-fill-column 80)
#+END_SRC

#+RESULTS:
: 80

*** Taking Notes
Setting the directories for the notes to be placed in - this will be synced soonish
#+BEGIN_SRC emacs-lisp
  (setq org-directory "~/git/org")
  (setq org-default-notes-file "~/git/org/personal.org")
#+END_SRC

#+RESULTS:
: ~/git/org/personal.org

This makes it easier to add links from outside
#+BEGIN_SRC emacs-lisp
  (defun ze0/yank-more ()
    (interactive)
    (insert "[[")
    (yank)
    (insert "][more]]"))
  (global-set-key (kbd "<f6>") 'ze0/yank-more)
#+END_SRC

#+RESULTS:
: ze0/yank-more

**** Track TODO state
<<todo-keywords>>
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
        '((sequence
           "TODO(t)"   ; next action
           "TOBLOG(b)"  ; next action
           "STARTED(s)"
           "WAITING(w@/!)"
           "SOMEDAY(.)" "|" "DONE(x!)" "CANCELLED(c@)")
          (sequence "TODELEGATE(-)" "DELEGATED(d)" "|" "COMPLETE(x)")))

  (setq org-todo-keyword-faces
        '(("TODO" . (:foreground "green" :weight bold))
          ("DONE" . (:foreground "cyan" :weight bold))
          ("WAITING" . (:foreground "red" :weight bold))
          ("SOMEDAY" . (:foregound "gray" :weight bold))))
#+END_SRC

#+RESULTS:
| TODO    | :foreground | green | :weight | bold |
| DONE    | :foreground | cyan  | :weight | bold |
| WAITING | :foreground | red   | :weight | bold |
| SOMEDAY | :foregound  | gray  | :weight | bold |

**** Projects
Don't inherit the project tag
#+BEGIN_SRC emacs-lisp
(setq org-tags-exclude-from-inheritance '("project"))
#+END_SRC

#+RESULTS:
| project |

This code makes it easy to focus on one project and it's tasks
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-speed-commands-user '("N" org-narrow-to-subtree))
  (add-to-list 'org-speed-commands-user '("W" widen))
  (defun ze0/org-agenda-for-subtree ()
    (interactive)
    (if (derived-mode-p 'org-agenda-mode)
        (let* ((marker (or (org-get-at-bol 'org-hd-marker)
                           (org-agenda-error)))
               (hdmarker (or (org-get-at-bol 'org-hd-marker) marker))
               (pos (marker-position-marker))
               (col (current-column))
               newhead)
          (org-with-remote-undo (marker-buffer marker)
            (with-current-buffer (marker-buffer marker)
              (widen)
              (let ((org-agenda-view-columns-initially t))
                (org-agenda nil "t" 'subtree)))))
      (let ((org-agenda-view-columns-initially t))
        (org-agenda nil "t" 'subtree))))
  (add-to-list 'org-speed-commands-user '("T" ze0/org-agenda-for-subtree))
#+END_SRC

#+RESULTS:
| T | ze0/org-agenda-for-subtree |
| W | widen                      |
| N | org-narrow-to-subtree      |

**** Track Time
#+BEGIN_SRC emacs-lisp
  (defun ze0/org-clock-in-set-state-to-started ()
    "Mark STARTED when clocked in."
    (save-excursion
      (catch 'exit
        (cond
         ((derived-mode-p 'org-agenda-mode)
          (let* ((marker (or (org-get-at-bol 'org-marker)
                             (org-agenda-error)))
                 (hdmarker (or (org-get-at-bol 'org-hd-marker) marker))
                 (pos (marker-position marker))
                 (col (current-column))
                 newhead)
            (org-with-remote-undo (marker-buffer marker)
              (with-current-buffer (marker-buffer marker)
                (widen)
                (goto-char pos)
                (org-back-to-heading t)
                (if (org-get-todo-state)
                    (org-todo "STARTED"))))))
         (t (if (org-get-todo-state)
                (org-todo "STARTED")))))))
  (use-package org
    :init
    (progn
      (setq org-clock-idle-time nil)
      (setq org-log-done 'time)
      (setq org-clock-persist t)
      (setq org-clock-report-include-clocking-task t))
    :config
    (progn
      (org-clock-persistence-insinuate)
      (add-hook 'org-clock-in-hook 'ze0/org-clock-in-set-state-to-started)))
#+END_SRC

#+RESULTS:
: t

Too many clock entries clutter up a heading
#+BEGIN_SRC emacs-lisp
  (setq org-log-into-drawer "LOGBOOK")
  (setq org-clock-into-drawer 1)
#+END_SRC

#+RESULTS:
: 1

**** Basic Configuration
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files
        (delq nil
              (mapcar (lambda (x) (and (file-exists-p x) x))
                      '("~/git/org/personal.org"
                        "~/git/org/university.org"
                        "~/git/org/work.org"
                        "~/git/org/journal.org"
                        "~/git/org/organizer.org"
                        "~/git/org/routines.org"))))
#+END_SRC

#+RESULTS:
| ~/git/org/personal.org | ~/git/org/university.org | ~/git/org/work.org | ~/git/org/journal.org | ~/git/org/organizer.org |

This is some configuration of Sacha's
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-span 2)
  (setq org-agenda-sticky nil)
  (setq org-agenda-show-log t)
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
  (setq org-agenda-time-grid
        '((daily today require-timed)
          "-------------"
          (800 1000 1200 1400 1600 1800)))
  (setq org-columns-default-format "%50ITEM %12SCHEDULED %TODO %3PRIORITY %Effort{:} %TAGS")
#+END_SRC

#+RESULTS:
: %50ITEM %12SCHEDULED %TODO %3PRIORITY %Effort{:} %TAGS

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x g") 'magit-status)
#+END_SRC

#+RESULTS:
: magit-status

